import headerOne, { head, solidUnorderedList, attentionParagraph } from '../Auto_Create_Pages.js';
const html = document.documentElement;
head(html, 'Programming Branches');
const body = document.getElementById('body');
const Branches = {
  Fa: [['برنامه نویسی وب (web)', 'هرچیزی که در مرورگرها باز میشود میگویند وب سایت که این سایت ها را برنامه نویس ها می سازند - مثل: نت فلیکس - گوگل'],
  ['برنامه نویسی موبایل (Mobile App)', 'تمامی نرم افزارها یی که در گوشی استفاده میکنید را اینرا برنامه نویسیان میسازند - مثل: ماشین حساب - دفترچه یادداشت - واتساپ - تلگرام - اپ های بانکی'],
  ['بازی سازی (Game Development)', 'این حوظه برای یک پلتفرم خاص نیست و هم برای موبایل و دسکتاپ و کنسول میتونه بازی بسازه و برنامه نویسی تنها برای این شاخه کافی نیست و ترکیبی از خلاقیت و گرافیک به همراه منطق هست.'],
  ['هوش مصنوعی و داده (AI & Data)', 'چت بات ها و تشخیص چهره - پیش بینی آب و هوا - تحلیل داده - پردازش تصویر و همه جاهم کاربرد دارند'],
  ['نرم افزار های دسکتاپ (Desktop Apps)', 'نرم افزار وُرد و فتوشاپ و تلگرام و ... را این حوظه میسازد ون مخصوص کامپیوتر هست.'],
  ['اینترنت اشیاء (IoT)', `خانه های هوشمند - خودروهای هوشمند - شهر های هوشمند.
    مثل: لامپ هایی که میشود با گوش تنظیمشان کرد یا برخی وسایل پزشکی که در بدن بیمار قرار میگیرند برای کنترل سلامتیش`
  ],
  ['برنامه نویسی سخت افزار', 'کنترل وسایل فیزیکی - حسگرها - موتور ها - ربات ها - مثال: کواد کوپتر - بازوهای مکانیکی']
  ],
  En: []
}
const attention = 'توجه! برنامه نویسی فقط یک مهارت نیست یه دنیا از مسیر های مختلف است.'

function Fa() {
  headerOne(body, 'Progtamming Branches');
  solidUnorderedList(body, 'شاخه های برنامه نویسی:', Branches.Fa);
  attentionParagraph(body, attention);
}
Fa();