import headerOne, { solidParagraph } from '../Auto_Create_Pages.js';
const body = document.getElementById('body');
const paragraphs = {
  starter: ['تازمانی که وارد کار برنامه نویسی نشده اید نمی نوانید به معنای رقیقش پی ببرید', ''],
  theGeneralConceptOfProgramming: ['مفهوم کلی برنامه نویسی اینه که برنامه ای را بنویسید.', ''],
  definitionOfProgramming: ['اجرای دستورالعمل هایی که مرتب اجرامیشن و یک خروجی به ما میدهند.', ""],
  pointOfProgrammingIsPrecise: ['نکته: برنامه باید خیلی دقیق باشد چون که کامپیوتر و سخت افزارها هوش ندارند و فقط کاری که ما گفتیم انجام میدهند نه کمتر و نه بیشتر.', ''],
  teaMaker: [
    "چای ساز یه برنامه براش نوشته شده که تازمانی که دما آب به این مقدار نرسیده گرم میشود و بعد از اینکه مثلا به دمای ۱۰۰ درجه رسید دیگه گرمتر نمیشه و زمانی که دماش به ۸۵ درجه رسید دوباره گرم میشود.", ''],
  washingMachine: ['لباسشویی که ما درجه و مدت زمان را مشخص میکنیم و دکمه شورع را که میزنیم فقط دستورات مارا انجام میدهد', ''],
  mostElectricalAppliances: ['دی دنیای واقعی اکثر مواردی که با برق کار میکنند از تکنولوژی های مختلف برنامه نویسی استفاده میکنند مثل: کامپیوتر و ماشین و وسایل آشپزخانه برقی و پزشکی و هوافضا ...', '']
}
function Fa() {

};
Fa();
function En() {

};