import header, { head, paragraph } from '../Auto_Create_Pages.js';
const html = document.documentElement;
head(html, 'coding career');
const body = document.getElementById('body');
const title = ['آینده شغلی بنامه نویسی و مسیر های درآمد زایی', 'coding career'];
const paragraphs = {
  careerFuture: { title: ['آینده شغلی برنامه نویسی', ''], paragraph: ['این شغلی است که در آینده ماندگار است و خود این شغل آنده را میسازد و هرچه تکنولوژی پیشرفته تر شود به این معناست که برنامه نویسان پیشرفته تر شدن.', ''] },
  mostIncome: { title: ['کدوم شاخه بیشتر پول در میاره؟', ''], point: ['تجربه و تخصص بالاتر = درآمد بالاتر', ''], one: ['شاخه برنامه نویسی وب و موبایل یادگیری آسانتری دارند و بازار کار بیشتری اما حقوق کمتی دارند.', ''], two: ['شاخه هوش مصنوعی و تحلیل داده یادگیری سخت تری دارند و بازار کار کمتری دارند اما حقوق بالاتری میگیرند.', ''] }
}
const monetizationMethods = [{
  title: "روش های درآمد زایی:",
  texts: [
    ['کارمندی:', 'میرید توی شرکت های نرم افزار سازی یا آژانس های پروژه بگیر کار میکنید و حضوری هست کارش اما حقوق ماهانه دارد و در نتیجه امنیت کاری قابل توجهی دارد نسبت به سایر روش های کسب درآمد اما انعطاف زمانی کمی دارد و باید کار در زمان معینی به اتمام برسد.'],
    ['فریلنسری:', 'هر جا و زمانی که دوست داشته باشی کار میکنی اما امنیت شغلی کمی دارد نسبت به سایر روش های کسب درامد چون که کاری است که باید پروژه بگیری و ممکنه که پروژه گیرت نیاد.'],
    ['ریموت:', 'شما با یک شرکت کار میکنی اما حضوری نمیخواد بری توی اون شرکت فقط کافیه که در زمان های معلوم پشت سیستمت باشی و آنلاین باشی و کارکنی علاوه بر این میتونید با شرکت های خارجی هم کار کنید چون که نیازی به حضور در خود اون شرکت ندارید'],
    ['ایده:', 'ممکنه که ایده ای داشته باشید که کسی آن را انجام نداده باشد و بتونید با ابداع آن به درامد بالایی برسید اما توجه داشته باشید که این کار نیاز به زمان و سرمایه اولیه قابل توجهی دارد و اینکه ممکنه که ایده شما مشتری نداشته باشد زماین که به اتمام رسید.']
  ]
}, {}]
let lang = 'Fa' // Fa / En
// FUNCTIONS
function Page(language) {
  let lang = language === 'Fa' ? 0 : 1;
}
Page('Fa');
